// Напишите программу, которая принимает на вход координаты двух точек
// и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53

Console.WriteLine("Введите координаты точки А ");
Console.WriteLine("xa: ");
int xa = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("ya: ");
int ya = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("za: ");
int za = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координаты точки B ");
Console.WriteLine("xb: ");
int xb = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("yb: ");
int yb = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("zb: ");
int zb = Convert.ToInt32(Console.ReadLine());